# Input and Output

In [3]:
import pandas as pd

In [4]:
url = "https://data.cityofnewyork.us/api/views/25th-nujf/rows.csv"

In [7]:
names = pd.read_csv(url)
names.head()

   Year of Birth  Gender Ethnicity Child's First Name  Count  Rank
0           2011  FEMALE  HISPANIC          GERALDINE     13    75
1           2011  FEMALE  HISPANIC                GIA     21    67
2           2011  FEMALE  HISPANIC             GIANNA     49    42
3           2011  FEMALE  HISPANIC            GISELLE     38    51
4           2011  FEMALE  HISPANIC              GRACE     36    53

## Export DataFrame to CSV File
- The `to_csv` method exports a **DataFrame** to a CSV file.
- Its first argument is the filename.
- By default, pandas will include the index. Set the `index` parameter to False to exclude the index.
- The `columns` parameter limits the exported columns.

In [12]:
names.to_csv("baby_names.csv", index=False, columns=["Year of Birth", "Child's First Name", "Count"])

## Install openpyxl Library to Read and Write Excel Files

## Import Excel File into pandas
- The `read_excel` function reads an Excel file/workbook into a **DataFrame**.
- Use the `sheet_name` parameter if the workbook contains multiple worksheets. Pass a single worksheet name or a list of worksheet names/index positions.
- Pass the `sheet_name` parameter an argument of **None** to include all worksheets.
- Pandas will store multiple worksheets in a Python dictionary. The keys will be the worksheet names, and the values will be the **DataFrames**.

In [15]:
pd.read_excel("Data - Single Worksheet.xlsx")

  First Name Last Name           City Gender
0    Brandon     James          Miami      M
1       Sean   Hawkins         Denver      M
2       Judy       Day    Los Angeles      F
3     Ashley      Ruiz  San Francisco      F
4  Stephanie     Gomez       Portland      F

In [22]:
pd.read_excel("Data - Multiple Worksheets.xlsx", sheet_name="Data 2") #default is to 
# bring int the first worksheet

pd.read_excel("Data - Multiple Worksheets.xlsx", sheet_name=0)
pd.read_excel("Data - Multiple Worksheets.xlsx", sheet_name=1)
pd.read_excel("Data - Multiple Worksheets.xlsx", sheet_name=[0,1]) #will come in as a dictionary
type(pd.read_excel("Data - Multiple Worksheets.xlsx", sheet_name=[0,1]) )

dict

In [35]:
data = pd.read_excel("Data - Multiple Worksheets.xlsx", sheet_name=None)
#None keyword captures them all :) 

d1 = data["Data 1"]

In [37]:
d2 = data["Data 2"]

pd.concat([d1, d2], ignore_index=True)

  First Name Last Name           City Gender
0    Brandon     James          Miami      M
1       Sean   Hawkins         Denver      M
2       Judy       Day    Los Angeles      F
3     Ashley      Ruiz  San Francisco      F
4  Stephanie     Gomez       Portland      F
5     Parker     Power        Raleigh      F
6    Preston  Prescott   Philadelphia      F
7    Ronaldo   Donaldo         Bangor      M
8      Megan   Stiller  San Francisco      M
9     Bustin    Jieber         Austin      F

## Export Excel File from pandas
- The **ExcelWriter** class writes one or more **DataFrames** to an Excel file.
- Use a context manager (the `with` keyword) in combination with the **ExcelWriter** object and an assigned variable.
- Invoke the `to_excel` method on every **DataFrame** to include in the Excel workbook and pass in the **ExcelWriter** object as the first argument.
- The `to_excel` method supports `sheet_name`, `index`, and `columns` parameters.

In [38]:
names.head()

   Year of Birth  Gender Ethnicity Child's First Name  Count  Rank
0           2011  FEMALE  HISPANIC          GERALDINE     13    75
1           2011  FEMALE  HISPANIC                GIA     21    67
2           2011  FEMALE  HISPANIC             GIANNA     49    42
3           2011  FEMALE  HISPANIC            GISELLE     38    51
4           2011  FEMALE  HISPANIC              GRACE     36    53

In [41]:
is_female = names["Gender"] == "FEMALE"
is_male = names["Gender"] == "MALE"
females = names[is_female]
males = names[is_male]

In [ ]:
with pd.ExcelWriter("NYC Baby Data.xlsx") as excel_file: